rkalyan95/stm32_ll_drivers/stm32_ll_rcc/src/stm32l433_ll_rcc.c

#include <stm32l433_ll_rcc.h>
#include <stdbool.h>

typedef uint8_t (*register_readfunction_t)(void);

#define MAX_TIMEOUTVALUE 10000

#define GET(x,pos)   ((x & 1UL<<pos) >> pos)
#define SET(x,pos)   (x |= (1UL<<pos))
#define CLEAR(x,pos)   (x &= ~(1UL<<pos))
#define TOGGLE(x,pos) (x ^= 1UL<<pos)
#define SET_BITS(v, p, n, new_val) \
  ((v) = ((v) & ~(((1UL << (n)) - 1) << (p))) | (((new_val) & ((1UL << (n)) - 1)) << (p)))

#define GET_BITS(v, p, n) \
  (((v) >> (p)) & ((1UL << (n)) - 1))

static RCC_TypeDef *RCC_ClockConfigs = ((RCC_TypeDef *) RCC_BASE);

static inline Error_t TimeoutHandler(register_readfunction_t rdy_func,uint8_t expected_value,uint32_t timeout)
{
    uint8_t currentvalue;
    do
    {
        currentvalue = rdy_func();
        timeout--;

    }while((currentvalue!=expected_value) && (timeout>0));

    if(timeout == 0)
    {
        return ERR_TIMEOUT;
    }
    else 
    {
        return ERR_SUCCESS;
    }
    
}

static inline uint8_t get_msirdy(void)
{
    return GET(RCC_ClockConfigs->CR,RCC_CR_MSIRDY_Pos);
}

static inline uint8_t get_hsirdy(void)
{
    return GET(RCC_ClockConfigs->CR,RCC_CR_HSIRDY_Pos);
}

static inline uint8_t get_hserdy(void)
{
    return GET(RCC_ClockConfigs->CR,RCC_CR_HSERDY_Pos);
}

static inline uint8_t get_pllrdy(void)
{
    return GET(RCC_ClockConfigs->CR,RCC_CR_PLLRDY_Pos);
}

static inline uint8_t get_pllsai1rdy(void)
{
    return GET(RCC_ClockConfigs->CR,RCC_CR_PLLSAI1RDY_Pos);
}


/* RCC_CR Register Starts */
Error_t RCC_EnableMSI(RccMsiRng_t range,bool En)
{
    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_MSIRANGE_Pos,4,range);
    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_MSION_Pos,1,En);
    return TimeoutHandler(get_msirdy, En ,MAX_TIMEOUTVALUE);
}

Error_t RCC_MsiRangeSelect(RccMsiRngSel_t RangeSrc)
{
    Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_MSIRGSEL_Pos,1,RangeSrc);
    RetCode = (GET_BITS(RCC_ClockConfigs->CR,RCC_CR_MSIRGSEL_Pos,1)==RangeSrc);
    return RetCode;
}


Error_t RCC_EnableHSI(bool kernelClock, bool autoStartStop,bool En)
{
    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_HSIKERON_Pos,1,kernelClock);
    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_HSIASFS_Pos,1,autoStartStop);
    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_HSION_Pos,1,En);
    return TimeoutHandler(get_hsirdy,En,MAX_TIMEOUTVALUE);
}

Error_t RCC_EnableHSE(RccHseByPass_t ByPassSetting,bool ClkSecuSet,bool En)
{

    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_HSEBYP_Pos,1,ByPassSetting);
    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_CSSON_Pos,1,ClkSecuSet);
    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_HSEON_Pos,1,En);
    return TimeoutHandler(get_hserdy,En,MAX_TIMEOUTVALUE);

}

Error_t RCC_EnableMainPLL(bool En)
{
    Error_t RetCode=ERR_FAILED;

    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_PLLON_Pos,1,En);

    return TimeoutHandler(get_pllrdy,En,MAX_TIMEOUTVALUE);

}

Error_t RCC_EnablePLLSAI1(bool En)
{
    Error_t RetCode=ERR_FAILED;

    SET_BITS(RCC_ClockConfigs->CR,RCC_CR_PLLSAI1ON_Pos,1,En);

    return TimeoutHandler(get_pllsai1rdy,En,MAX_TIMEOUTVALUE);

}


/*RCC_CR Register Ends*/

/* RCC_CFGR Register Starts */

Error_t RCC_SetSystemClockSource(RCCSysClkSource_t source)
{

    SET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_SW_Pos,2,source);
    return (GET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_SW_Pos,2)==source);

}

Error_t RCC_SetAHBPrescaler(AhbPrescaler_t prescaler)
{

    SET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_HPRE_Pos,4,prescaler);
    return (GET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_HPRE_Pos,4)==prescaler);

}

Error_t RCC_SetAPB1Prescaler(Apb1Prescaler_t prescaler)
{
    SET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_PPRE1_Pos,3,prescaler);
    return (GET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_PPRE1_Pos,3)==prescaler);
}

Error_t RCC_SetAPB2Prescaler(Apb1Prescaler_t prescaler)
{
    SET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_PPRE2_Pos,3,prescaler);
    return (GET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_PPRE2_Pos,3)==prescaler);
}

 Error_t RCC_ConfigureMCO(RccMcoSource_t source, RccMcoPrescaler_t prescaler)
 {

    SET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_MCOSEL_Pos,4,source);
    SET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_MCOPRE_Pos,3,prescaler);

    return (GET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_MCOPRE_Pos,3)==prescaler && GET_BITS(RCC_ClockConfigs->CFGR,RCC_CFGR_MCOSEL_Pos,4)==source);

 }
 
/* RCC_CFGR Register Ends */

/* RCC_PLLCFGR Register Starts */

Error_t RCC_ConfigurePllSrc(RccPllSrc_t PllSrc)
{

    SET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLSRC_Pos,2,PllSrc);

    return (GET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLSRC_Pos,2)==PllSrc);
}

Error_t RCC_ConfigurePllSettings(RccPllM_t RccPllM,RccPllP_t RccPllP ,RccPllQ_t RccPllQ,RccPllR_t RccPllR,uint8_t RccPllN,uint8_t RccPllDiv)
{
    Error_t RetCode=ERR_FAILED;

    SET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLM_Pos,3,RccPllM);
    SET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLN_Pos,7,RccPllN);
    SET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLP_Pos,1,RccPllP);
    SET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLQ_Pos,2,RccPllQ);
    SET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLR_Pos,2,RccPllR);
    SET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLPDIV_Pos,5,RccPllDiv);

    RetCode =     ((GET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLM_Pos,3)==RccPllM) 
                                    && (GET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLN_Pos,7)==RccPllN)
                                    && (GET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLP_Pos,1)==RccPllP)
                                    && (GET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLQ_Pos,2)==RccPllQ)
                                    && (GET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLR_Pos,2)==RccPllR)
                                    && (GET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLPDIV_Pos,5)==RccPllDiv));

    return RetCode;
}

Error_t RCC_EnablePllR(bool En)
{

    SET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLREN_Pos,1,En);

    return (GET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLREN_Pos,1)==En);
}

Error_t RCC_EnablePllQ(bool En)
{

    SET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLQEN_Pos,1,En);

    return (GET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLQEN_Pos,1)==En);
}

Error_t RCC_EnablePllP(bool En)
{

    SET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLPEN_Pos,1,En);
   
    return (GET_BITS(RCC_ClockConfigs->PLLCFGR,RCC_PLLCFGR_PLLPEN_Pos,1)==En);
}
/* RCC_PLLCFGR Register Ends */

