rkalyan95/stm32_ll_drivers/stm32_ll_rcc/src/stm32l433_ll_rcc.c
/* RCC_PLLSAI1CFGR Register Starts */
Error_t RCC_ConfigurePllSai1Settings(RccPllM_t RccPllM,RccPllP_t RccPllP ,RccPllQ_t RccPllQ,RccPllR_t RccPllR,uint8_t RccPllSai1N,uint8_t RccPllSai1Div)
{
    Error_t RetCode=ERR_FAILED;

    SET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1N_Pos,7,RccPllSai1N);
    SET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1P_Pos,1,RccPllP);
    SET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1Q_Pos,2,RccPllQ);
    SET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1R_Pos,2,RccPllR);
    SET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1PDIV_Pos,5,RccPllSai1Div);

    RetCode =   ((GET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1N_Pos,7)==RccPllSai1N)
                    && (GET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1P_Pos,1)==RccPllP)
                    && (GET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1Q_Pos,2)==RccPllQ)
                    && (GET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1R_Pos,2)==RccPllR)
                    && (GET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1PDIV_Pos,5)==RccPllSai1Div));
    return RetCode;
}

Error_t RCC_EnablePllSai1R(bool En)
{
    Error_t RetCode=ERR_FAILED;

    SET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1REN_Pos,1,En);

    return (GET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1REN_Pos,1)==En);
}

Error_t RCC_EnablePllSai1Q(bool En)
{
    Error_t RetCode=ERR_FAILED;

    SET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1QEN_Pos,1,En);

    return (GET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1QEN_Pos,1)==En);
}

Error_t RCC_EnablePllSai1P(bool En)
{
    Error_t RetCode=ERR_FAILED;

    SET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1PEN_Pos,1,En);

    return (GET_BITS(RCC_ClockConfigs->PLLSAI1CFGR,RCC_PLLSAI1CFGR_PLLSAI1PEN_Pos,1)==En);
}

/* RCC_PLLSAI1CFGR Register Ends */

/* RCC_CIER Register Starts */

Error_t RCC_EnableInterrupt(Rcc_InterruptClock_t ClockType)
{
    Error_t RetCode=ERR_FAILED;

    switch(ClockType)
    {
        case RCC_LSIINTR:
            SET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_LSIRDYIE_Pos,1,1);
            RetCode = (GET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_LSIRDYIE_Pos,1)==1);
            break;
        case RCC_LSEINTR:
            SET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_LSERDYIE_Pos,1,1);
            RetCode = (GET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_LSERDYIE_Pos,1)==1);
            break;
        case RCC_MSIINTR:
            SET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_MSIRDYIE_Pos,1,1);
            RetCode = (GET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_MSIRDYIE_Pos,1)==1);
            break;
        case RCC_HSIINTR:
            SET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_HSIRDYIE_Pos,1,1);
            RetCode = (GET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_HSIRDYIE_Pos,1)==1);
            break;
        case RCC_HSEINTR:
            SET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_HSERDYIE_Pos,1,1);
            RetCode = (GET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_HSERDYIE_Pos,1)==1);
            break;
        case RCC_PLLINTR:
            SET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_PLLRDYIE_Pos,1,1);
            RetCode = (GET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_PLLRDYIE_Pos,1)==1);
            break;
        case RCC_PLLSAI1INTR:
            SET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_PLLSAI1RDYIE_Pos,1,1);
            RetCode = (GET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_PLLSAI1RDYIE_Pos,1)==1);
            break;
        case RCC_LSECSSINTR:
            SET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_LSECSSIE_Pos,1,1);
            RetCode = (GET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_LSECSSIE_Pos,1)==1);
            break;
        case RCC_HSI48INTR:
            SET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_HSI48RDYIE_Pos,1,1);
            RetCode = (GET_BITS(RCC_ClockConfigs->CIER,RCC_CIER_HSI48RDYIE_Pos,1)==1);
            break;
        default:
            return RetCode;
    }

    return RetCode;
}

/* RCC_CIER Register Ends */

/* RCC_CIFR Register Starts */
bool RCC_GetClockInterrupt(Rcc_InterruptClock_t ClockType)
{
 

    switch(ClockType)
    {
        case RCC_LSIINTR:
            return GET(RCC_ClockConfigs->CIFR,RCC_CIFR_LSIRDYF_Pos);
        case RCC_LSEINTR:
            return GET(RCC_ClockConfigs->CIFR,RCC_CIFR_LSERDYF_Pos);
        case RCC_MSIINTR:
            return GET(RCC_ClockConfigs->CIFR,RCC_CIFR_MSIRDYF_Pos);
        case RCC_HSIINTR:
            return GET(RCC_ClockConfigs->CIFR,RCC_CIFR_HSIRDYF_Pos);
        case RCC_HSEINTR:
            return GET(RCC_ClockConfigs->CIFR,RCC_CIFR_HSERDYF_Pos);
        case RCC_PLLINTR:
            return GET(RCC_ClockConfigs->CIFR,RCC_CIFR_PLLRDYF_Pos);
        case RCC_PLLSAI1INTR:
            return GET(RCC_ClockConfigs->CIFR,RCC_CIFR_PLLSAI1RDYF_Pos);
        case RCC_LSECSSINTR:
            return GET(RCC_ClockConfigs->CIFR,RCC_CIFR_LSECSSF_Pos);
        case RCC_HSI48INTR:
            return GET(RCC_ClockConfigs->CIFR,RCC_CIFR_HSI48RDYF_Pos);
        default:
            return 0;
    }
}
/* RCC_CIFR Register Ends */

/* RCC_CICSR Register Starts */
Error_t RCC_ClearClockInterrupt(Rcc_InterruptClock_t ClockType)
{

    Error_t RetCode=ERR_FAILED;

    switch(ClockType)
    {
        case RCC_LSIINTR:
            SET(RCC_ClockConfigs->CICR,RCC_CICR_LSIRDYC_Pos);
            RetCode = GET(RCC_ClockConfigs->CICR,RCC_CICR_LSIRDYC_Pos);
            break;
        case RCC_LSEINTR:
            SET(RCC_ClockConfigs->CICR,RCC_CICR_LSERDYC_Pos);
            RetCode = GET(RCC_ClockConfigs->CICR,RCC_CICR_LSERDYC_Pos);
            break;
        case RCC_MSIINTR:
            SET(RCC_ClockConfigs->CICR,RCC_CICR_MSIRDYC_Pos);
            RetCode = GET(RCC_ClockConfigs->CICR,RCC_CICR_MSIRDYC_Pos);
            break;
        case RCC_HSIINTR:
            SET(RCC_ClockConfigs->CICR,RCC_CICR_HSIRDYC_Pos);
            RetCode = GET(RCC_ClockConfigs->CICR,RCC_CICR_HSIRDYC_Pos);
            break;
        case RCC_HSEINTR:
            SET(RCC_ClockConfigs->CICR,RCC_CICR_HSERDYC_Pos);
            RetCode = GET(RCC_ClockConfigs->CICR,RCC_CICR_HSERDYC_Pos);
            break;
        case RCC_PLLINTR:
            SET(RCC_ClockConfigs->CICR,RCC_CICR_PLLRDYC_Pos);
            RetCode = GET(RCC_ClockConfigs->CICR,RCC_CICR_PLLRDYC_Pos);
            break;
        case RCC_PLLSAI1INTR:
            SET(RCC_ClockConfigs->CICR,RCC_CICR_PLLSAI1RDYC_Pos);
            RetCode = GET(RCC_ClockConfigs->CICR,RCC_CICR_PLLSAI1RDYC_Pos);
            break;
        case RCC_LSECSSINTR:
            SET(RCC_ClockConfigs->CICR,RCC_CICR_LSECSSC_Pos);
            RetCode = GET(RCC_ClockConfigs->CICR,RCC_CICR_LSECSSC_Pos);
            break;
        case RCC_HSI48INTR:
            SET(RCC_ClockConfigs->CICR,RCC_CICR_HSI48RDYC_Pos);
            RetCode = GET(RCC_ClockConfigs->CICR,RCC_CICR_HSI48RDYC_Pos);
            break;
        default:
            return RetCode;
    }

    return RetCode;
}
/* RCC_CICR Register Ends */

/*RCC AHB1RSTR Register starts*/

void RCC_ResetAhb1Peripheral(Rcc_Ahb1Peripheral_t peripheral)
{

    switch (peripheral)
    {
        case AHB1_DMA1:
            SET(RCC_ClockConfigs->AHB1RSTR,RCC_AHB1RSTR_DMA1RST_Pos);
            CLEAR(RCC_ClockConfigs->AHB1RSTR,RCC_AHB1RSTR_DMA1RST_Pos);
            break;
        case AHB1_DMA2:
            SET(RCC_ClockConfigs->AHB1RSTR,RCC_AHB1RSTR_DMA2RST_Pos);
            CLEAR(RCC_ClockConfigs->AHB1RSTR,RCC_AHB1RSTR_DMA2RST_Pos);
            break;
        case AHB1_FLASH:
            SET(RCC_ClockConfigs->AHB1RSTR,RCC_AHB1RSTR_FLASHRST_Pos);
            CLEAR(RCC_ClockConfigs->AHB1RSTR,RCC_AHB1RSTR_FLASHRST_Pos);
            break;
        case AHB1_CRC:
            SET(RCC_ClockConfigs->AHB1RSTR,RCC_AHB1RSTR_CRCRST_Pos);
            CLEAR(RCC_ClockConfigs->AHB1RSTR,RCC_AHB1RSTR_CRCRST_Pos);
            break;
        case AHB1_TSC:
            SET(RCC_ClockConfigs->AHB1RSTR,RCC_AHB1RSTR_TSCRST_Pos);
            CLEAR(RCC_ClockConfigs->AHB1RSTR,RCC_AHB1RSTR_TSCRST_Pos);
            break;
        default:
            return;
    }   
}
/*RCC AHB1RSTR Register ends*/

/*RCC AHB2RSTR Register starts*/

void RCC_ResetAhb2Peripheral(Rcc_Ahb2Peripheral_t peripheral)
{

    switch (peripheral)
    {
        case AHB2_GPIOA:
            SET(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIOARST_Pos);
            CLEAR(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIOARST_Pos);
            break;
        case AHB2_GPIOB:
            SET(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIOBRST_Pos);
            CLEAR(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIOBRST_Pos);
            break;
        case AHB2_GPIOC:
            SET(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIOCRST_Pos);
            CLEAR(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIOCRST_Pos);
            break;
        case AHB2_GPIOD:
            SET(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIODRST_Pos);
            CLEAR(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIODRST_Pos);
            break;
        case AHB2_GPIOE:
            SET(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIOERST_Pos);
            CLEAR(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIOERST_Pos);
            break;
        case AHB2_GPIOH:
            SET(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIOHRST_Pos);
            CLEAR(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_GPIOHRST_Pos);
            break;
        case AHB2_ADC:
            SET(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_ADCRST_Pos);
            CLEAR(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_ADCRST_Pos);
            break;
        case AHB2_RNG:
            SET(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_RNGRST_Pos);
            CLEAR(RCC_ClockConfigs->AHB2RSTR,RCC_AHB2RSTR_RNGRST_Pos);
            break;
        default:
            return;
    } 
}
void RCC_ResetAhb3Peripheral(Rcc_Ahb3Peripheral_t peripheral)
{


    switch (peripheral)
    {
        case AHB3_QSPI:
            SET(RCC_ClockConfigs->AHB3RSTR,RCC_AHB3RSTR_QSPIRST_Pos);
            CLEAR(RCC_ClockConfigs->AHB3RSTR,RCC_AHB3RSTR_QSPIRST_Pos);
            break;
        default:
            return;
    }    
}

/*RCC AHB2RSTR Register ends*/

