rkalyan95/stm32_ll_drivers/stm32_ll_rcc/src/stm32l433_ll_rcc.c
/*RCC APB1RSTR1 Register starts*/

void RCC_ResetApb1Peripheral1(Rcc_Apb1Peripheral1_t peripheral)
{

    switch (peripheral)
    {
        case APB1_TIM2:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_TIM2RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_TIM2RST_Pos);
            break;
        case APB1_TIM6:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_TIM6RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_TIM6RST_Pos);
            break;
        case APB1_TIM7:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_TIM7RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_TIM7RST_Pos);
            break;
        case APB1_LCD:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_LCDRST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_LCDRST_Pos);
            break;
        case APB1_SPI2:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_SPI2RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_SPI2RST_Pos);
            break;
        case APB1_SPI3:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_SPI3RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_SPI3RST_Pos);
            break;
        case APB1_USART2:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_USART2RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_USART2RST_Pos);
            break;
        case APB1_USART3:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_USART3RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_USART3RST_Pos);
            break;
        case APB1_I2C1:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_I2C1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_I2C1RST_Pos);
            break;
        case APB1_I2C2:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_I2C2RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_I2C2RST_Pos);
            break;
        case APB1_I2C3:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_I2C3RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_I2C3RST_Pos);
            break;
        case APB1_CRS:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_CRSRST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_CRSRST_Pos);
            break;
        case APB1_CAN1:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_CAN1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_CAN1RST_Pos);
            break;
        case APB1_USBFS:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_USBFSRST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_USBFSRST_Pos);
            break;
        case APB1_PWR:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_PWRRST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_PWRRST_Pos);
            break;
        case APB1_DAC1:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_DAC1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_DAC1RST_Pos);
            break;
        case APB1_OPAMP:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_OPAMPRST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_OPAMPRST_Pos);
            break;
        case APB1_LPTIM1:
            SET(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_LPTIM1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR1,RCC_APB1RSTR1_LPTIM1RST_Pos);
            break;
        default:
            return;
    }
}
/*RCC APB1RSTR1 Register ends*/

/*RCC APB1RSTR2 Register starts*/
void RCC_ResetApb1Peripheral2(Rcc_Apb1Peripheral2_t peripheral)
{


    switch (peripheral)
    {
        case APB1P2_LPUART1:
            SET(RCC_ClockConfigs->APB1RSTR2,RCC_APB1RSTR2_LPUART1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR2,RCC_APB1RSTR2_LPUART1RST_Pos);
            break;
        case APB1P2_SWPMI1:
            SET(RCC_ClockConfigs->APB1RSTR2,RCC_APB1RSTR2_SWPMI1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR2,RCC_APB1RSTR2_SWPMI1RST_Pos);
            break;
        case APB1P2_LPTIM2:
            SET(RCC_ClockConfigs->APB1RSTR2,RCC_APB1RSTR2_LPTIM2RST_Pos);
            CLEAR(RCC_ClockConfigs->APB1RSTR2,RCC_APB1RSTR2_LPTIM2RST_Pos);
            break;
        default:
            return;
    }

}
/*RCC APB1RSTR2 Register ends*/
/*RCC APB2RSTR Register starts*/

void RCC_ResetApb2Peripheral(Rcc_Apb2Peripheral_t peripheral)
{

    switch (peripheral)
    {
        case APB2_SYSCFG:
            SET(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_SYSCFGRST_Pos);
            CLEAR(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_SYSCFGRST_Pos);
            break;
        case APB2_SDMMC:
            SET(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_SDMMC1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_SDMMC1RST_Pos);
            break;
        case APB2_TIM1:
            SET(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_TIM1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_TIM1RST_Pos);
            break;
        case APB2_SPI1:
            SET(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_SPI1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_SPI1RST_Pos);
            break;
        case APB2_USART1:
            SET(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_USART1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_USART1RST_Pos);
            break;
        case APB2_TIM15:
            SET(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_TIM15RST_Pos);
            CLEAR(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_TIM15RST_Pos);
            break;
        case APB2_TIM16:
            SET(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_TIM16RST_Pos);
            CLEAR(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_TIM16RST_Pos);
            break;
        case APB2_SAI1:
            SET(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_SAI1RST_Pos);
            CLEAR(RCC_ClockConfigs->APB2RSTR,RCC_APB2RSTR_SAI1RST_Pos);
            break;
        default:
           return;
    }
}


