rkalyan95/stm32_ll_drivers/stm32_ll_rcc/src/stm32l433_ll_rcc.c
/*RCC APB2RSTR Register ends*/

/*RCC AHB1ENR Starts*/
Error_t RCC_EnableAhb1Peripheral(Rcc_Ahb1Peripheral_t peripheral)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case AHB1_DMA1:
            SET(RCC_ClockConfigs->AHB1ENR,RCC_AHB1ENR_DMA1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB1ENR_DMA1EN_Pos);
            break;
        case AHB1_DMA2:
            SET(RCC_ClockConfigs->AHB1ENR,RCC_AHB1ENR_DMA2EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB1ENR_DMA2EN_Pos);            
            break;
        case AHB1_FLASH:
            SET(RCC_ClockConfigs->AHB1ENR,RCC_AHB1ENR_FLASHEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB1ENR_FLASHEN_Pos); 
            break;
        case AHB1_CRC:
            SET(RCC_ClockConfigs->AHB1ENR,RCC_AHB1ENR_CRCEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB1ENR_CRCEN_Pos);
            break;
        case AHB1_TSC:
            SET(RCC_ClockConfigs->AHB1ENR,RCC_AHB1ENR_TSCEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB1ENR_TSCEN_Pos);
            break;
        default:
            return RetCode;
    }  
    
    return RetCode;
}
/*RCC AHB1ENR Ends*/
/*RCC AHB2ENR Starts*/
Error_t RCC_EnableAhb2Peripheral(Rcc_Ahb2Peripheral_t peripheral)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case AHB2_GPIOA:
            SET(RCC_ClockConfigs->AHB2ENR,RCC_AHB2ENR_GPIOAEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB2ENR_GPIOAEN_Pos);
            break;
        case AHB2_GPIOB:
            SET(RCC_ClockConfigs->AHB2ENR,RCC_AHB2ENR_GPIOBEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB2ENR_GPIOBEN_Pos);
            break;
        case AHB2_GPIOC:
            SET(RCC_ClockConfigs->AHB2ENR,RCC_AHB2ENR_GPIOCEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB2ENR_GPIOCEN_Pos);
            break;
        case AHB2_GPIOD:
            SET(RCC_ClockConfigs->AHB2ENR,RCC_AHB2ENR_GPIODEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB2ENR_GPIODEN_Pos);
            break;
        case AHB2_GPIOE:
            SET(RCC_ClockConfigs->AHB2ENR,RCC_AHB2ENR_GPIOEEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB2ENR_GPIOEEN_Pos);
            break;
        case AHB2_GPIOH:
            SET(RCC_ClockConfigs->AHB2ENR,RCC_AHB2ENR_GPIOHEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB2ENR_GPIOHEN_Pos);
            break;
        case AHB2_ADC:
            SET(RCC_ClockConfigs->AHB2ENR,RCC_AHB2ENR_ADCEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB2ENR_ADCEN_Pos);
            break;
        case AHB2_RNG:
            SET(RCC_ClockConfigs->AHB2ENR,RCC_AHB2ENR_RNGEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB2ENR_RNGEN_Pos);
            break;
        default:
            return RetCode;
    } 

     return RetCode;
}

/*RCC AHB2ENR Ends*/

/*RCC AHB3ENR Starts*/
Error_t RCC_EnableAhb3Peripheral(Rcc_Ahb3Peripheral_t peripheral)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case AHB3_QSPI:
            SET(RCC_ClockConfigs->AHB3ENR,RCC_AHB3ENR_QSPIEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_AHB3ENR_QSPIEN_Pos);
            break;
        default:
            return RetCode;
    }
    
    return RetCode;
}
/*RCC AHB3ENR Ends*/

/*RCC APB1ENR Register starts*/

Error_t RCC_EnableApb1Peripheral1(Rcc_Apb1Peripheral1_t peripheral)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case APB1_TIM2:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_TIM2EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_TIM2EN_Pos);
            break;
        case APB1_TIM6:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_TIM6EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_TIM6EN_Pos);
            break;
        case APB1_TIM7:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_TIM7EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_TIM7EN_Pos);
            break;
        case APB1_LCD:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_LCDEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_LCDEN_Pos);
            break;
        case APB1_SPI2:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_SPI2EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_SPI2EN_Pos);
            break;
        case APB1_SPI3:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_SPI3EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_SPI3EN_Pos);
            break;
        case APB1_USART2:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_USART2EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_USART2EN_Pos);
            break;
        case APB1_USART3:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_USART3EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_USART3EN_Pos);
            break;
        case APB1_I2C1:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_I2C1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_I2C1EN_Pos);
            break;
        case APB1_I2C2:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_I2C2EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_I2C2EN_Pos);
            break;
        case APB1_I2C3:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_I2C3EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_I2C3EN_Pos);
            break;
        case APB1_CRS:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_CRSEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_CRSEN_Pos);
            break;
        case APB1_CAN1:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_CAN1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_CAN1EN_Pos);
            break;
        case APB1_USBFS:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_USBFSEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_USBFSEN_Pos);
            break;
        case APB1_PWR:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_PWREN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_PWREN_Pos);
            break;
        case APB1_DAC1:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_DAC1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_DAC1EN_Pos);
            break;
        case APB1_OPAMP:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_OPAMPEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_OPAMPEN_Pos);
            break;
        case APB1_LPTIM1:
            SET(RCC_ClockConfigs->APB1ENR1,RCC_APB1ENR1_LPTIM1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR1_LPTIM1EN_Pos);
            break;
        default:
            return RetCode;
    }

    return RetCode;
}
/*RCC APB1ENR Register ends*/

/*RCC APB1RSTR2 Register starts*/
Error_t RCC_EnableApb1Peripheral2(Rcc_Apb1Peripheral2_t peripheral)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case APB1P2_LPUART1:
            SET(RCC_ClockConfigs->APB1ENR2,RCC_APB1ENR2_LPUART1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR2_LPUART1EN_Pos);
            break;
        case APB1P2_SWPMI1:
            SET(RCC_ClockConfigs->APB1ENR2,RCC_APB1ENR2_SWPMI1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR2_SWPMI1EN_Pos);
            break;
        case APB1P2_LPTIM2:
            SET(RCC_ClockConfigs->APB1ENR2,RCC_APB1ENR2_LPTIM2EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB1ENR2_LPTIM2EN_Pos);
            break;
        default:
           return RetCode;
    }

    return RetCode;
}
/*RCC APB1RSTR2 Register ends*/


/*RCC APB2ENR Register starts*/

Error_t RCC_EnableApb2Peripheral(Rcc_Apb2Peripheral_t peripheral)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case APB2_SYSCFG:
            SET(RCC_ClockConfigs->APB2ENR,RCC_APB2ENR_SYSCFGEN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB2ENR_SYSCFGEN_Pos);
            break;
        case APB2_SDMMC:
            SET(RCC_ClockConfigs->APB2ENR,RCC_APB2ENR_SDMMC1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB2ENR_SDMMC1EN_Pos);
            break;
        case APB2_TIM1:
            SET(RCC_ClockConfigs->APB2ENR,RCC_APB2ENR_TIM1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB2ENR_TIM1EN_Pos);
            break;
        case APB2_SPI1:
            SET(RCC_ClockConfigs->APB2ENR,RCC_APB2ENR_SPI1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB2ENR_SPI1EN_Pos);
            break;
        case APB2_USART1:
            SET(RCC_ClockConfigs->APB2ENR,RCC_APB2ENR_USART1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB2ENR_USART1EN_Pos);
            break;
        case APB2_TIM15:
            SET(RCC_ClockConfigs->APB2ENR,RCC_APB2ENR_TIM15EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB2ENR_TIM15EN_Pos);
            break;
        case APB2_TIM16:
            SET(RCC_ClockConfigs->APB2ENR,RCC_APB2ENR_TIM16EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB2ENR_TIM16EN_Pos);
            break;
        case APB2_SAI1:
            SET(RCC_ClockConfigs->APB2ENR,RCC_APB2ENR_SAI1EN_Pos);
            RetCode = GET(RCC_ClockConfigs->AHB1ENR,RCC_APB2ENR_SAI1EN_Pos);
            break;
        default:
            return RetCode;
    }
}


/*RCC APB2ENR Register ends*/ 

