rkalyan95/stm32_ll_drivers/stm32_ll_rcc/src/stm32l433_ll_rcc.c
/*RCC AHB1ENR Starts*/
Error_t RCC_EnableDuringSleepAhb1Peripheral(Rcc_Ahb1Peripheral_t peripheral,bool SleepEn)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case AHB1_DMA1:
            SET_BITS(RCC_ClockConfigs->AHB1SMENR,RCC_AHB1SMENR_DMA1SMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB1SMENR,RCC_AHB1SMENR_DMA1SMEN_Pos,1)==SleepEn);
            break;
        case AHB1_DMA2:
            SET_BITS(RCC_ClockConfigs->AHB1SMENR,RCC_AHB1SMENR_DMA2SMEN_Pos,1,SleepEn);
             RetCode = (GET_BITS(RCC_ClockConfigs->AHB1SMENR, RCC_AHB1SMENR_DMA2SMEN_Pos, 1) == SleepEn);
            break;
        case AHB1_FLASH:
            SET_BITS(RCC_ClockConfigs->AHB1SMENR,RCC_AHB1SMENR_FLASHSMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB1SMENR, RCC_AHB1SMENR_FLASHSMEN_Pos, 1) == SleepEn);
            break;
        case AHB1_CRC:
            SET_BITS(RCC_ClockConfigs->AHB1SMENR,RCC_AHB1SMENR_CRCSMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB1SMENR, RCC_AHB1SMENR_CRCSMEN_Pos, 1) == SleepEn);
            break;
        case AHB1_TSC:
            SET_BITS(RCC_ClockConfigs->AHB1SMENR,RCC_AHB1SMENR_TSCSMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB1SMENR, RCC_AHB1SMENR_TSCSMEN_Pos, 1) == SleepEn);
            break;
        default:
            return RetCode;
    }  
    
    return RetCode;
}
/*RCC AHB1ENR Ends*/
/*RCC AHB2ENR Starts*/
Error_t RCC_EnableDuringSleepAhb2Peripheral(Rcc_Ahb2Peripheral_t peripheral,bool SleepEn)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case AHB2_GPIOA:
            SET_BITS(RCC_ClockConfigs->AHB2SMENR,RCC_AHB2SMENR_GPIOASMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB2SMENR, RCC_AHB2SMENR_GPIOASMEN_Pos, 1) == SleepEn);
            break;
        case AHB2_GPIOB:
            SET_BITS(RCC_ClockConfigs->AHB2SMENR,RCC_AHB2SMENR_GPIOBSMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB2SMENR, RCC_AHB2SMENR_GPIOBSMEN_Pos, 1) == SleepEn);
            break;
        case AHB2_GPIOC:
            SET_BITS(RCC_ClockConfigs->AHB2SMENR,RCC_AHB2SMENR_GPIOCSMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB2SMENR, RCC_AHB2SMENR_GPIOCSMEN_Pos, 1) == SleepEn);
            break;
        case AHB2_GPIOD:
            SET_BITS(RCC_ClockConfigs->AHB2SMENR,RCC_AHB2SMENR_GPIODSMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB2SMENR, RCC_AHB2SMENR_GPIODSMEN_Pos, 1) == SleepEn);
            break;
        case AHB2_GPIOE:
            SET_BITS(RCC_ClockConfigs->AHB2SMENR,RCC_AHB2SMENR_GPIOESMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB2SMENR, RCC_AHB2SMENR_GPIOESMEN_Pos, 1) == SleepEn);
            break;
        case AHB2_GPIOH:
            SET_BITS(RCC_ClockConfigs->AHB2SMENR,RCC_AHB2SMENR_GPIOHSMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB2SMENR, RCC_AHB2SMENR_GPIOHSMEN_Pos, 1) == SleepEn);
            break;
        case AHB2_ADC:
            SET_BITS(RCC_ClockConfigs->AHB2SMENR,RCC_AHB2SMENR_ADCSMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB2SMENR, RCC_AHB2SMENR_ADCSMEN_Pos, 1) == SleepEn);
            break;
        case AHB2_RNG:
            SET_BITS(RCC_ClockConfigs->AHB2SMENR,RCC_AHB2SMENR_RNGSMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB2SMENR, RCC_AHB2SMENR_RNGSMEN_Pos, 1) == SleepEn);
            break;
        default:
            return RetCode;
    } 

    return RetCode;
}

/*RCC AHB2ENR Ends*/

/*RCC AHB3ENR Starts*/
Error_t RCC_EnableDuringSleepAhb3Peripheral(Rcc_Ahb3Peripheral_t peripheral,bool SleepEn)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case AHB3_QSPI:
            SET_BITS(RCC_ClockConfigs->AHB3SMENR,RCC_AHB3SMENR_QSPISMEN_Pos,1,SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->AHB3SMENR, RCC_AHB3SMENR_QSPISMEN_Pos, 1) == SleepEn);
            break;
        default:
            return RetCode;
    }    

    return RetCode;
}
/*RCC AHB3ENR Ends*/

/*RCC APB1ENR Register starts*/

Error_t RCC_EnableDuringSleepApb1Peripheral1(Rcc_Apb1Peripheral1_t peripheral,bool SleepEn)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case APB1_TIM2:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_TIM2SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_TIM2SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_TIM6:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_TIM6SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_TIM6SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_TIM7:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_TIM7SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_TIM7SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_LCD:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_LCDSMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_LCDSMEN_Pos, 1) == SleepEn);
            break;
        case APB1_SPI2:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_SPI2SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_SPI2SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_SPI3:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_SPI3SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_SPI3SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_USART2:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_USART2SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_USART2SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_USART3:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_USART3SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_USART3SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_I2C1:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_I2C1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_I2C1SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_I2C2:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_I2C2SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_I2C2SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_I2C3:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_I2C3SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_I2C3SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_CRS:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_CRSSMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_CRSSMEN_Pos, 1) == SleepEn);
            break;
        case APB1_CAN1:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_CAN1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_CAN1SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_USBFS:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_USBFSSMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_USBFSSMEN_Pos, 1) == SleepEn);
            break;
        case APB1_PWR:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_PWRSMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_PWRSMEN_Pos, 1) == SleepEn);
            break;
        case APB1_DAC1:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_DAC1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_DAC1SMEN_Pos, 1) == SleepEn);
            break;
        case APB1_OPAMP:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_OPAMPSMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_OPAMPSMEN_Pos, 1) == SleepEn);
            break;
        case APB1_LPTIM1:
            SET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_LPTIM1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR1, RCC_APB1SMENR1_LPTIM1SMEN_Pos, 1) == SleepEn);
            break;
        default:
    }

    return RetCode;
}
/*RCC APB1ENR Register ends*/

/*RCC APB1RSTR2 Register starts*/
Error_t RCC_EnableDuringSleepApb1Peripheral2(Rcc_Apb1Peripheral2_t peripheral,bool SleepEn)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case APB1P2_LPUART1:
            SET_BITS(RCC_ClockConfigs->APB1SMENR2, RCC_APB1SMENR2_LPUART1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR2, RCC_APB1SMENR2_LPUART1SMEN_Pos, 1) == SleepEn);
            break;
        case APB1P2_SWPMI1:
            SET_BITS(RCC_ClockConfigs->APB1SMENR2, RCC_APB1SMENR2_SWPMI1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR2, RCC_APB1SMENR2_SWPMI1SMEN_Pos, 1) == SleepEn);
            break;
        case APB1P2_LPTIM2:
            SET_BITS(RCC_ClockConfigs->APB1SMENR2, RCC_APB1SMENR2_LPTIM2SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB1SMENR2, RCC_APB1SMENR2_LPTIM2SMEN_Pos, 1) == SleepEn);
            break;
        default:
            return RetCode;
    }
    return RetCode;
}
/*RCC APB1RSTR2 Register ends*/


/*RCC APB2ENR Register starts*/

Error_t RCC_EnableDuringSleepApb2Peripheral(Rcc_Apb2Peripheral_t peripheral,bool SleepEn)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case APB2_SYSCFG:
            SET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_SYSCFGSMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_SYSCFGSMEN_Pos, 1) == SleepEn);
            break;
        case APB2_SDMMC:
            SET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_SDMMC1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_SDMMC1SMEN_Pos, 1) == SleepEn);
            break;
        case APB2_TIM1:
            SET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_TIM1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_TIM1SMEN_Pos, 1) == SleepEn);
            break;
        case APB2_SPI1:
            SET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_SPI1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_SPI1SMEN_Pos, 1) == SleepEn);
            break;
        case APB2_USART1:
            SET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_USART1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_USART1SMEN_Pos, 1) == SleepEn);
            break;
        case APB2_TIM15:
            SET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_TIM15SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_TIM15SMEN_Pos, 1) == SleepEn);
            break;
        case APB2_TIM16:
            SET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_TIM16SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_TIM16SMEN_Pos, 1) == SleepEn);
            break;
        case APB2_SAI1:
            SET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_SAI1SMEN_Pos, 1, SleepEn);
            RetCode = (GET_BITS(RCC_ClockConfigs->APB2SMENR, RCC_APB2SMENR_SAI1SMEN_Pos, 1) == SleepEn);
            break;
        default:
            return RetCode;
    }
    return RetCode; 
}
Error_t RCC_ConfigureCciprClocks(Rcc_CciprPeripheral_t peripheral , Rcc_Ccipr_ClockSrc_t src)
{
    Error_t RetCode=ERR_FAILED;
    switch (peripheral)
    {
        case CCIPR_USART1SEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_USART1SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_USART1SEL_Pos, 2) == src);
            break;
        case CCIPR_USART2SEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_USART2SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_USART2SEL_Pos, 2) == src);
            break;
        case CCIPR_USART3SEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_USART3SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_USART3SEL_Pos, 2) == src);
            break;
        case CCIPR_LPUART1SEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_LPUART1SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_LPUART1SEL_Pos, 2) == src);
            break;
        case CCIPR_I2C1SEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_I2C1SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_I2C1SEL_Pos, 2) == src);
            break;
        case CCIPR_I2C2SEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_I2C2SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_I2C2SEL_Pos, 2) == src);
            break;
        case CCIPR_I2C3SEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_I2C3SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_I2C3SEL_Pos, 2) == src);
            break;
        case CCIPR_LPTIM1SEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_LPTIM1SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_LPTIM1SEL_Pos, 2) == src);
            break;
        case CCIPR_LPTIM2SEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_LPTIM2SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_LPTIM2SEL_Pos, 2) == src);
            break;
        case CCIPR_SAISEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_SAI1SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_SAI1SEL_Pos, 2) == src);
            break;
        case CCIPR_CLK48SEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_CLK48SEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_CLK48SEL_Pos, 2) == src);
            break;
        case CCIPR_ADCSEL:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_ADCSEL_Pos, 2, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_ADCSEL_Pos, 2) == src);
            break;
        case CCIPR_SWPMI1:
            SET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_SWPMI1SEL_Pos, 1, src);
            RetCode = (GET_BITS(RCC_ClockConfigs->CCIPR, RCC_CCIPR_SWPMI1SEL_Pos, 1) == src);
            break;
        default:
            // Handle unknown peripheral or error
            return RetCode;
    }
   return RetCode;  
}
/*RCC APB2ENR Register ends*/ 
/*RCC BDCR Starts */
Error_t RCC_BdcrEnableLse(bool BdcrLseEn)
{
    Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSEON_Pos, 1, BdcrLseEn);
    RetCode = (GET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSEON_Pos, 1) == BdcrLseEn);
    return RetCode;
}

Error_t RCC_BdcrConfigureLseByp(bool BypEn)
{
    Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSEBYP_Pos, 1, BypEn);
    RetCode = (GET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSEBYP_Pos, 1) == BypEn);
    return RetCode;
}

Error_t RCC_BdcrConfigureLseSpeed(Rcc_Bdcr_LseSpeed_t spd)
{
    Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSEDRV_Pos, 2, spd);
    RetCode = (GET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSEDRV_Pos, 2) == spd);
    return RetCode;
}

Error_t RCC_BdcrLseCssConfigure(bool LseCssEn)
{
    Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSECSSON_Pos, 1, LseCssEn);
    RetCode = (GET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSECSSON_Pos, 1) == LseCssEn);
    return RetCode;
}


Error_t Rcc_BdcrConfigureRtcSource(Rcc_Bdcr_RtcSource_t src)
{
    Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_RTCSEL_Pos, 2, src);
    RetCode = (GET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_RTCSEL_Pos, 2) == src);
    return RetCode;
}

