rkalyan95/stm32_ll_drivers/stm32_ll_rcc/src/stm32l433_ll_rcc.c
Error_t Rcc_BdcrConfigureRtcClk(bool RtcClkEn)
{
	Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_RTCEN_Pos, 1, RtcClkEn);
    RetCode = (GET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_RTCEN_Pos, 1) == RtcClkEn);
    return RetCode;
}

Error_t Rcc_BdcrConfigureBdRst(bool BdRst)
{
	Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_BDRST_Pos, 1, BdRst);
    RetCode = (GET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_BDRST_Pos, 1) == BdRst);
    return RetCode;
}

Error_t Rcc_ConfigureLscoEn(bool LscoEn)
{
	Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSCOEN_Pos, 1, LscoEn);
    RetCode = (GET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSCOEN_Pos, 1) == LscoEn);
    return RetCode;
}

Error_t Rcc_ConfigureLseSel(bool LseSel)
{
	Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSCOSEL_Pos, 1, LseSel);
    RetCode = (GET_BITS(RCC_ClockConfigs->BDCR, RCC_BDCR_LSCOSEL_Pos, 1) == LseSel);
    return RetCode;
}

/*RCC BDCR Ends*/

/*RCC CSR Starts*/

Error_t Rcc_EnableLsiCsr(bool LsiCsrEn)
{
    Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->CSR,RCC_CSR_LSION_Pos,1,LsiCsrEn);
    return RetCode;
}
Error_t Rcc_ConfigureMsiRangeCsr(Rcc_CsrMsiRng_t MsiRange)
{
	Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->CSR,RCC_CSR_MSISRANGE_Pos,4,MsiRange);
    RetCode = (GET_BITS(RCC_ClockConfigs->CSR, RCC_CSR_MSISRANGE_Pos, 4) == MsiRange);
    return RetCode;
}

Error_t Rcc_RmVfCsr(bool RmvfEn)
{
	Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->CSR, RCC_CSR_RMVF_Pos, 1, RmvfEn);
    RetCode = (GET_BITS(RCC_ClockConfigs->CSR, RCC_CSR_RMVF_Pos, 1) == RmvfEn);
    return RetCode;
}
/*RCC CSR Ends*/

/*RCC CRRCR Starts*/

Error_t Rcc_CrrCrHsi48Enable(bool Hsi48En)
{
    Error_t RetCode=ERR_FAILED;
    SET_BITS(RCC_ClockConfigs->CRRCR, RCC_CRRCR_HSI48ON_Pos, 1, Hsi48En);
    RetCode = (GET_BITS(RCC_ClockConfigs->CRRCR, RCC_CRRCR_HSI48ON_Pos, 1) == Hsi48En);
    return RetCode;
}

/*RCC CRRCR Ends*/
